Revit 2022 API
AnalyticalModelStick.GetProjectionPlaneZ Method
 Retrieves analytical model projection information for Z direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public ElementId GetProjectionPlaneZ(
	AnalyticalElementSelector selector
)
Visual Basic
Public Function GetProjectionPlaneZ ( _
	selector As AnalyticalElementSelector _
) As ElementId
Visual C++
public:
ElementId^ GetProjectionPlaneZ(
	AnalyticalElementSelector selector
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
 End of the analytical model.
Return Value
 Plane on to which analytical model is projected, or invalidElementId if not projected to a Plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModelStick Class
Autodesk.Revit.DB.Structure Namespace